<?php
//8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».

$mass = array('Московская область' => array('Москва', 'Зеленоград', 'Клин'),
    'Ленинградская область' => array('Санкт-Петербург', 'Павловск', 'Кронштадт'),
    'Рязанская область' => array('Скопин', 'Михайлов', 'Касимов'));

foreach ($mass as $obl => $towns) {
    echo "$obl: <br>";
    foreach ($towns as $town) {
        if (mb_substr($town, 0, 1) == 'К')
            echo "$town; <br>";
    }
}






